app/views/map/index.html.erb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 48.856614) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - 2.3522219) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 48.856614 AND locations.longitude >= 2.3522219) THEN 45.0 WHEN (locations.latitude < 48.856614 AND locations.longitude >= 2.3522219) THEN 135.0 WHEN (locations.latitude < 48.856614 AND locations.longitude < 2.3522219) THEN 225.0 WHEN (locations.latitude >= 48.856614 AND locations.longitude < 2.3522219) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 48.5671504337783 AND 49.1460775662217 AND locations.longitude BETWEEN 1.9122713442828663 AND 2.7921724557171337) ORDER BY distance ASC LIMIT 10
---

<%= content_tag 'div', id: "map", class: "map overthrow", data: { locations: Location.limit(10) } do %>